Configuration_project_01/src/Catalogs/ПартииТМЦВЭксплуатации/ПартииТМЦВЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПартииТМЦВЭксплуатации</name>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
      <types>DocumentRef.ПервичныйДокумент</types>
      <types>DocumentRef.ВводОстатков</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЭксплуатации</name>
    <type>
      <types>CatalogRef.КатегорииЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентарныйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияЭксплуатации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПогашенияСтоимостиБУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияНаработки</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемНаработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПогашенияСтоимостиНУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
</mdclass:Catalog>

Configuration_project_01/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <basedOn>Document.Встреча</basedOn>
  <basedOn>Document.ТелефонныйЗвонок</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоИсходящее</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <comment>Дата рождения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <comment>Пол</comment>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>Уточнение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Configuration_project_01/src/Catalogs/ПартииТМЦВЭксплуатации/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("ОграничениеВыбора") 
		ИЛИ НЕ Параметры.ОграничениеВыбора Тогда
		Элементы.ОтборВЭксплуатации.Видимость = Ложь;
	КонецЕсли;

	УстановитьСвойстваДинамическогоСписка();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборВЭксплуатацииПриИзменении(Элемент)
	
	УстановитьОтборы(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСвойстваДинамическогоСписка()

	Если НЕ Параметры.Свойство("ОграничениеВыбора") 
		ИЛИ НЕ Параметры.ОграничениеВыбора Тогда
		Возврат;
	КонецЕсли;
	
	ОтборВЭксплуатации = 1;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Дата", Дата(1, 1, 1, 0, 0, 0));
	ПараметрыЗапроса.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	ПараметрыЗапроса.Вставить("Подразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
	ПараметрыЗапроса.Вставить("ФизическоеЛицо", Справочники.ФизическиеЛица.ПустаяСсылка());
	ПараметрыЗапроса.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	ПараметрыЗапроса.Вставить("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());

	Если Параметры.Свойство("ТекущийРегистратор") Тогда
		
		ПараметрыЗапроса.Вставить("ТекущийРегистратор", Неопределено);
	
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПартииТМЦВЭксплуатацииПереопределяемый.Ссылка,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.ПометкаУдаления,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.Наименование,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.Документ,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.Дата,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.КатегорияЭксплуатации,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.ИнвентарныйУчет,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.ИнвентарныйНомер,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.СрокЭксплуатации,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.ДатаЗавершенияЭксплуатации,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.СпособПогашенияСтоимостиБУ,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.ЕдиницаИзмеренияНаработки,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.ОбъемНаработки,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.СтатьяРасходов,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.АналитикаРасходов,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.ФизическоеЛицо,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.СпособПогашенияСтоимостиНУ,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.НаправлениеДеятельности,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.Предопределенный,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.ПартииТМЦВЭксплуатации КАК ПартииТМЦВЭксплуатацииПереопределяемый
		|ГДЕ
		|	НЕ ПартииТМЦВЭксплуатацииПереопределяемый.ПометкаУдаления
		|
		|	И (НЕ &ОтборДата
		|		ИЛИ ПартииТМЦВЭксплуатацииПереопределяемый.ДатаЗавершенияЭксплуатации > &Дата
		|		ИЛИ ПартииТМЦВЭксплуатацииПереопределяемый.ДатаЗавершенияЭксплуатации = ДАТАВРЕМЯ(1, 1, 1))
		|
		|	И ПартииТМЦВЭксплуатацииПереопределяемый.Ссылка В
		|		(ВЫБРАТЬ
		|			ВложенныйЗапрос.Ссылка 
		|		ИЗ (ВЫБРАТЬ
		|				ТМЦВЭксплуатации.Партия КАК Ссылка,
		|				ТМЦВЭксплуатации.КоличествоОборот КАК КоличествоОборот
		|			ИЗ
		|				РегистрНакопления.ТМЦВЭксплуатации.Обороты(,,,
		|					(НЕ &ОтборОрганизация
		|							ИЛИ Организация = &Организация)
		|						И (НЕ &ОтборПодразделение
		|							ИЛИ Подразделение = &Подразделение)
		|						И (НЕ &ОтборФизическоеЛицо
		|							ИЛИ ФизическоеЛицо = &ФизическоеЛицо)
		|						И (НЕ &ОтборНоменклатура
		|							ИЛИ Номенклатура = &Номенклатура)
		|						И (НЕ &ОтборХарактеристика
		|							ИЛИ Характеристика = &Характеристика)) КАК ТМЦВЭксплуатации
		|			ГДЕ
		|				&ОтборВЭксплуатации = 1
		|	
		|			ОБЪЕДИНИТЬ ВСЕ
		|
		|			ВЫБРАТЬ
		|				ТМЦВЭксплуатации.Партия,
		|				ТМЦВЭксплуатации.Количество
		|			ИЗ
		|				РегистрНакопления.ТМЦВЭксплуатации КАК ТМЦВЭксплуатации
		|			ГДЕ
		|				&ОтборВЭксплуатации = 0
		|				И (НЕ &ОтборОрганизация
		|						ИЛИ Организация = &Организация)
		|				И (НЕ &ОтборПодразделение
		|						ИЛИ Подразделение = &Подразделение)
		|				И (НЕ &ОтборФизическоеЛицо
		|						ИЛИ ФизическоеЛицо = &ФизическоеЛицо)
		|				И (НЕ &ОтборНоменклатура
		|						ИЛИ Номенклатура = &Номенклатура)
		|				И (НЕ &ОтборХарактеристика
		|						ИЛИ Характеристика = &Характеристика)
		|	
		|			ОБЪЕДИНИТЬ ВСЕ
		|
		|			ВЫБРАТЬ
		|				ТМЦВЭксплуатации.Партия,
		|				-ТМЦВЭксплуатации.Количество
		|			ИЗ
		|				РегистрНакопления.ТМЦВЭксплуатации КАК ТМЦВЭксплуатации
		|			ГДЕ
		|				&ОтборВЭксплуатации = 1
		|				И ТМЦВЭксплуатации.Регистратор = &ТекущийРегистратор
		|				И (НЕ &ОтборОрганизация
		|					ИЛИ ТМЦВЭксплуатации.Организация = &Организация)
		|				И (НЕ &ОтборПодразделение
		|					ИЛИ ТМЦВЭксплуатации.Подразделение = &Подразделение)
		|				И (НЕ &ОтборФизическоеЛицо
		|					ИЛИ ТМЦВЭксплуатации.ФизическоеЛицо = &ФизическоеЛицо)
		|				И (НЕ &ОтборНоменклатура
		|					ИЛИ ТМЦВЭксплуатации.Номенклатура = &Номенклатура)
		|				И (НЕ &ОтборХарактеристика
		|					ИЛИ ТМЦВЭксплуатации.Характеристика = &Характеристика)
		|
		|			) КАК ВложенныйЗапрос
		|
		|		СГРУППИРОВАТЬ ПО
		|			ВложенныйЗапрос.Ссылка
		|
		|		ИМЕЮЩИЕ
		|			СУММА(ВложенныйЗапрос.КоличествоОборот) > 0
		|				ИЛИ &ОтборВЭксплуатации = 0)";
		
	Иначе
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПартииТМЦВЭксплуатацииПереопределяемый.Ссылка,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.ПометкаУдаления,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.Наименование,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.Документ,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.Дата,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.КатегорияЭксплуатации,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.ИнвентарныйУчет,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.ИнвентарныйНомер,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.СрокЭксплуатации,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.ДатаЗавершенияЭксплуатации,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.СпособПогашенияСтоимостиБУ,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.ЕдиницаИзмеренияНаработки,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.ОбъемНаработки,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.СтатьяРасходов,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.АналитикаРасходов,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.ФизическоеЛицо,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.СпособПогашенияСтоимостиНУ,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.НаправлениеДеятельности,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.Предопределенный,
		|	ПартииТМЦВЭксплуатацииПереопределяемый.ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.ПартииТМЦВЭксплуатации КАК ПартииТМЦВЭксплуатацииПереопределяемый
		|ГДЕ
		|	НЕ ПартииТМЦВЭксплуатацииПереопределяемый.ПометкаУдаления
		|
		|	И (НЕ &ОтборДата
		|		ИЛИ ПартииТМЦВЭксплуатацииПереопределяемый.ДатаЗавершенияЭксплуатации > &Дата
		|		ИЛИ ПартииТМЦВЭксплуатацииПереопределяемый.ДатаЗавершенияЭксплуатации = ДАТАВРЕМЯ(1, 1, 1))
		|
		|	И (&ОтборВЭксплуатации = 1
		|		И ПартииТМЦВЭксплуатацииПереопределяемый.Ссылка В
		|				(ВЫБРАТЬ
		|					ТМЦВЭксплуатации.Партия КАК Ссылка
		|				ИЗ
		|					РегистрНакопления.ТМЦВЭксплуатации.Обороты(,,, 
		|						(НЕ &ОтборОрганизация
		|								ИЛИ Организация = &Организация)
		|						И (НЕ &ОтборПодразделение
		|								ИЛИ Подразделение = &Подразделение)
		|						И (НЕ &ОтборФизическоеЛицо
		|								ИЛИ ФизическоеЛицо = &ФизическоеЛицо)
		|						И (НЕ &ОтборНоменклатура
		|								ИЛИ Номенклатура = &Номенклатура)
		|						И (НЕ &ОтборХарактеристика
		|								ИЛИ Характеристика = &Характеристика)) КАК ТМЦВЭксплуатации
		|				ГДЕ
		|					ТМЦВЭксплуатации.КоличествоОборот > 0)
		|
		|		ИЛИ &ОтборВЭксплуатации = 0
		|			И ПартииТМЦВЭксплуатацииПереопределяемый.Ссылка В
		|				(ВЫБРАТЬ
		|					ТМЦВЭксплуатации.Партия КАК Ссылка
		|				ИЗ
		|					РегистрНакопления.ТМЦВЭксплуатации КАК ТМЦВЭксплуатации
		|				ГДЕ
		|					(НЕ &ОтборОрганизация
		|							ИЛИ Организация = &Организация)
		|					И (НЕ &ОтборПодразделение
		|							ИЛИ Подразделение = &Подразделение)
		|					И (НЕ &ОтборФизическоеЛицо
		|							ИЛИ ФизическоеЛицо = &ФизическоеЛицо)
		|					И (НЕ &ОтборНоменклатура
		|							ИЛИ Номенклатура = &Номенклатура)
		|					И (НЕ &ОтборХарактеристика
		|							ИЛИ Характеристика = &Характеристика)))";
		
	КонецЕсли;
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
	
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Параметры);
	
	Для Каждого КлючИЗначение Из ПараметрыЗапроса Цикл
		Список.Параметры.УстановитьЗначениеПараметра(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		Список.Параметры.УстановитьЗначениеПараметра("Отбор" + КлючИЗначение.Ключ, ЗначениеЗаполнено(КлючИЗначение.Значение));
	КонецЦикла;
	
	УстановитьОтборы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборы(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Форма.Список,
		"ОтборВЭксплуатации",
		Форма.ОтборВЭксплуатации);

КонецПроцедуры

#КонецОбласти
